rikkapro0128/system_node_esp32_iot/src/main.cpp
#define WDT_TIMEOUT 5 // second

#define SSL_HANDSHAKE_REQUIRE 100
#define MAX_CONNECTION_FAILURE 5

#define PIN_RESET_DEFLAUT GPIO_NUM_13

#define STATUS_PIN_START GPIO_NUM_16
#define STATUS_PIN_WIFI GPIO_NUM_17

#define TIME_RESET_DEFAULT 5000
#define POOLING_CHECK_CONNECT_AP 5000
#define POOLING_CHECK_STREAM 5200
#define POOLING_RESTART_CONNECT_AP 700

#define STATUS_START_DELAY_FLICKER_SHORT 100
#define STATUS_START_DELAY_FLICKER_LONG 1000

// => disable macro firebase

// Comment to exclude Cloud Firestore
#undef ENABLE_FIRESTORE

// Comment to exclude Firebase Cloud Messaging
#undef ENABLE_FCM

// Comment to exclude Firebase Storage
#undef ENABLE_FB_STORAGE

// Comment to exclude Cloud Storage
#undef ENABLE_GC_STORAGE

// Comment to exclude Cloud Function for Firebase
#undef ENABLE_FB_FUNCTIONS

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MACRO - NODE TYPE - LOGIC *********************************************************************************************************************************************************************************************************************************
 */

#ifdef LOGIC

#define MAX_NAME_INDEX_FIREBASE 25
#define TIMER_INTERVAL_MS 1000
#define ERROR_TIMER 10
#define PIN_OUT 3
#define NUMS_TIMER 30

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MACRO - NODE TYPE - COLOR *********************************************************************************************************************************************************************************************************************************
 */

#ifdef COLOR

// define here...

typedef enum MODE_RGB
{
  SINGLE = 0,
  AUTO = 1,
};

typedef enum INDEX_COLOR
{
  COLOR_R = 0,
  COLOR_G = 1,
  COLOR_B = 2,
  COLOR_ALPHA = 3,
};

#define DI GPIO_NUM_27
#define NUMS_LED 16

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MODE DEV & DEPLOY *********************************************************************************************************************************************************************************************************************************
 */

#define _DEBUG_
#define _RELEASE_

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* VARIABLE GLOBAL *********************************************************************************************************************************************************************************************************************************
 */

// => STATIC
static const char *ntpServer = "pool.ntp.org";
static const char *CHost = "miru.io-";

// => RAM INSIDE
String getMac = WiFi.macAddress();
String GEN_ID_BY_MAC = String(getMac);
String ID_DEVICE;
String DATABASE_URL = "";
unsigned long timeStartResetPinDetach;
unsigned long epochTime;
unsigned long wifiStatus;
unsigned long poolingReconnectWifi;
unsigned long poolingCheckStream;
unsigned long blinkStart;
unsigned long timeIntervalCheckRamSize;
uint8_t countBlink = 0;
uint8_t countConnectionFailure = 0;
bool restartConfigWifi = false;
bool lostConnection = false;
bool blockBtnReset = false;
bool disableBtnReset = false;
bool globalRestart = false;
bool lostStream = false;
bool disconnected = false;
size_t timeoutWifi = 0;

// => RAM NODE TYPE LOGIC
#ifdef LOGIC

static const char *TYPE_DEVICE = "LOGIC";
bool timeControll = false;
bool blockControl = false;
bool control = true;
bool isFirst = true;
size_t timeDebounceLocalControl = 0;
size_t idControl = 0;
int uartPicControl = 0;
unsigned long sendDataPrevMillis = 0;
unsigned long timerStack[NUMS_TIMER][3];
bool stateDevice[3] = {false, false, false};
bool stateDeviceFirebase[3] = {false, false, false};
char indexTimerStack[NUMS_TIMER][MAX_NAME_INDEX_FIREBASE];

// => Firebase data
FirebaseJson timerParseArray;
FirebaseJsonData timerJson;
FirebaseJsonData deviceJson;

#endif

#ifdef COLOR
// define here...
static const char *TYPE_DEVICE = "COLOR";

uint8_t colorPresentState[4] = {0, 0, 255, 0}; // => rgb(0 -> 255, 0 -> 255, 0 -> 255, 0 -> 100)
uint8_t colorFultureState[4] = {0, 0, 255, 0}; // => rgb(0 -> 255, 0 -> 255, 0 -> 255, 0 -> 100)
bool acceptChange = false;
bool clearEffect = false;
bool requestRestart = false;
unsigned long rgbModeAuto;
uint16_t autoIndexI = 0, autoIndexJ = 0;

// => Firebase data
FirebaseJsonData deviceJson;

#endif

// => Firebase data general
FirebaseJson jsonNewDevice;

// => JSON DOCUMENT
DynamicJsonDocument bufferBodyPaserModeAP(400);

/**
 * ********* CONTRUCTOR NODE TYPE - COLOR *********************************************************************************************************************************************************************************************************************************
 */

#ifdef COLOR
Adafruit_NeoPixel strip = Adafruit_NeoPixel(NUMS_LED, DI, NEO_GRB + NEO_KHZ800);
#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE GENERAL *********************************************************************************************************************************************************************************************************************************
 */

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

