rikkapro0128/system_node_esp32_iot/src/main.cpp
// => DEBUG FUNC

#ifdef _DEBUG_
void viewEEPROM();
#endif

// => FUNC WEBSEVER SERVER
void controllDevices(AsyncWebServerRequest *request, JsonVariant &json);
void pingResponse(AsyncWebServerRequest *request);
void checkLinkAppication(AsyncWebServerRequest *request);
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json);
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json);
void restartWifiAccess(AsyncWebServerRequest *request);
void resetConfigurationWifi(AsyncWebServerRequest *request);
void resetConfigurationFirebase(AsyncWebServerRequest *request);
void checkConfiguration(AsyncWebServerRequest *request);
void notFound(AsyncWebServerRequest *request);
void restartEsp(AsyncWebServerRequest *request);

// => FUNC EXECUTE GENERAL

void initWatchdogTimer();
bool removeNodeEsp();
void initSignal();
void initResetDeflaut();
void checkRam();
uint32_t ramHeapSize();
void setupStreamFirebase();
void checkFirebaseInit();
void setupWifiModeStation();
void setupWebserverModeAP();
void clearBufferFirebaseDataAll();
unsigned long Get_Epoch_Time();
void streamCallback(FirebaseStream data);
void streamTimeoutCallback(bool timeout);
unsigned int strLength(const char *str);

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> LOGIC *********************************************************************************************************************************************************************************************************************************
 */

#ifdef LOGIC
#ifdef _DEBUG_
void PrintListTimer();
#endif
void parserTimerJson(FirebaseStream &data, uint8_t numberDevice, bool isInit = true);
void parserDeviceStatus(FirebaseStream &data, uint8_t numberDevice);
void controllDevice(uint8_t numDevice, bool state, bool syncFirebase = false, bool ignore = false);
void readTimer(FirebaseJson &fbJson, uint8_t numberDevice, String keyAdd = "");
void removeTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE], String key, bool isCallBack = false);
void sortTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE]);
#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> COLOR *********************************************************************************************************************************************************************************************************************************
 */

// define here....
#ifdef COLOR

bool fadeColor(INDEX_COLOR index);
void setColorChainRGBA(uint32_t c, uint8_t a);
void parserColorRGB(FirebaseStream &data, String prefix = "");
uint8_t parserColorMode(FirebaseStream &data, bool init = false);
uint8_t parserNumsLed(FirebaseStream &data, bool init = false);
uint32_t Wheel(byte WheelPos);
void clearEffectColor(uint8_t brightness = 100);

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* EEPROM *********************************************************************************************************************************************************************************************************************************
 */
EepromMiru eeprom(350, "esp8266-device-db-default-rtdb.firebaseio.com");

/**
 * ********* SERVER *********************************************************************************************************************************************************************************************************************************
 */
AsyncWebServer server(80);

/**
 * ********* FIREBASE *******************************************************************************************************************************************************************************************************************************
 */
FirebaseData fbdoStream;
FirebaseData fbdoControl;
FirebaseData createNode;
FirebaseData removeNode;

FirebaseAuth auth;
FirebaseConfig config;

/**
 * ********* WIFI MODE - STATION ********************************************************************************************************************************************************************************************************************
 */

String mode_ap_ssid = "esp32-";
String mode_ap_pass = "44448888";

void setup()
{
  initResetDeflaut();
  initSignal();

  GEN_ID_BY_MAC.replace(":", "");
  ID_DEVICE = String("device-" + GEN_ID_BY_MAC);

#ifdef _DEBUG_
  Serial.begin(115200);
#endif
#ifdef _RELEASE_
  Serial.begin(115200);
#endif

#ifdef COLOR
  strip.begin();
  strip.setBrightness(100);
  strip.show();
#endif

#ifdef _DEBUG_
  Serial.println("");
  Serial.println("[---PROGRAM START---]");
#endif

#ifdef _DEBUG_
  Serial.println("[DEBUG] - Init Watchdog timer");
#endif
  initWatchdogTimer();

  configTime(0, 0, ntpServer);
  eeprom.begin();

#ifdef _DEBUG_
  viewEEPROM();
#endif

#ifdef _DEBUG_
  Serial.printf("[DEBUG] - Init Number Led Strip RGB - %d\n", eeprom.numsLed);
#endif
  if (eeprom.numsLed > 0 && eeprom.numsLed < 1000)
  {
    strip.updateLength((uint16_t)eeprom.numsLed);
  }

  WiFi.hostname(String(CHost + GEN_ID_BY_MAC));
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(true);
  WiFi.softAP(String(mode_ap_ssid + GEN_ID_BY_MAC).c_str(), mode_ap_pass.c_str());

#ifdef _DEBUG_
  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
#endif

  setupWifiModeStation();

  while (WiFi.status() != WL_CONNECTED)
  {
    if (timeoutWifi > 12)
    {
      WiFi.disconnect(true);
      break;
    }
    timeoutWifi++;
    delay(500);
  }

