rikkapro0128/system_node_esp32_iot/src/main.cpp
  if (WiFi.status() == WL_CONNECTED)
  {
    digitalWrite(STATUS_PIN_WIFI, HIGH);
  }
  else
  {
    digitalWrite(STATUS_PIN_WIFI, LOW);
  }

  setupWebserverModeAP();

  config.database_url = eeprom.databaseUrl;
  config.signer.test_mode = true;
  // RTDB Stream reconnect timeout (interval) in ms (1 sec - 1 min) when RTDB Stream closed and want to resume.
  config.timeout.rtdbStreamReconnect = 1 * 1000;
  // WiFi reconnect timeout (interval) in ms (10 sec - 5 min) when WiFi disconnected.
  config.timeout.wifiReconnect = 10 * 1000;
  // Socket begin connection timeout (ESP32) or data transfer timeout (ESP8266) in ms (1 sec - 1 min).
  config.timeout.socketConnection = 30 * 1000;
  // Server response read timeout in ms (1 sec - 1 min).
  config.timeout.serverResponse = 10 * 1000;
  // RTDB Stream keep-alive timeout in ms (20 sec - 2 min) when no server's keep-alive event data received.
  config.timeout.rtdbKeepAlive = 45 * 1000;
  // RTDB Stream error notification timeout (interval) in ms (3 sec - 30 sec). It determines how often the readStream
  // will return false (error) when it called repeatedly in loop.
  config.timeout.rtdbStreamError = 3 * 1000;
#ifdef ESP8266
  fbdoStream.setBSSLBufferSize(1024 /* Rx in bytes, 512 - 16384 */, 1024 /* Tx in bytes, 512 - 16384 */);
#endif

  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  checkFirebaseInit();
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

void loop()
{

  if (globalRestart)
  {
    ESP.restart();
  }

  if (restartConfigWifi) // restart & init new connection to access point
  {
    if (millis() - poolingReconnectWifi > POOLING_RESTART_CONNECT_AP)
    {
      uint8_t statusWL = WiFi.status();
#ifdef _DEBUG_
      Serial.println("[Restart] Status Wifi " + String(statusWL));
#endif
      poolingReconnectWifi = millis();
      if (statusWL == WL_CONNECTED)
      {
        if (countConnectionFailure > 0)
        {
          countConnectionFailure = 0;
        }
#ifdef COLOR
        clearEffect = true;
        acceptChange = true;
#endif
        digitalWrite(STATUS_PIN_WIFI, HIGH);
        clearBufferFirebaseDataAll();
        checkFirebaseInit();
      }
      else if (statusWL == WL_NO_SHIELD)
      {
        setupWifiModeStation();
      }
      else
      {
        lostConnection = true;
        WiFi.reconnect();
      }
      restartConfigWifi = false;
    }
  }

  if (millis() - wifiStatus > POOLING_CHECK_CONNECT_AP && !restartConfigWifi) // check status connect, reconnect if this conection failure!
  {
    uint8_t statusWL = WiFi.status();
    wifiStatus = millis();
#ifdef _DEBUG_
    Serial.println("[Pooling check] Status Wifi " + String(statusWL));
#endif
    if (statusWL == WL_CONNECTED)
    {
      disconnected = false;
      if (countConnectionFailure > 0)
      {
        countConnectionFailure = 0;
      }
      if (lostConnection)
      {
#ifdef COLOR
        clearEffect = true;
#endif
        lostConnection = false;
      }
#ifdef COLOR
      acceptChange = true;
#endif
      digitalWrite(STATUS_PIN_WIFI, HIGH);
    }
    else if (statusWL == WL_CONNECTION_LOST)
    {
      lostConnection = true;
      WiFi.reconnect();
      fbdoStream.tcpClient.networkReconnect();
      digitalWrite(STATUS_PIN_WIFI, LOW);
    }
    else if (statusWL == WL_IDLE_STATUS || statusWL == WL_DISCONNECTED || statusWL == WL_NO_SSID_AVAIL || statusWL == WL_NO_SHIELD || statusWL == WL_CONNECT_FAILED)
    {
      if (countConnectionFailure < MAX_CONNECTION_FAILURE)
      {
        restartConfigWifi = true;
      }
      else
      {
        if (!disconnected)
        {
          if (WiFi.disconnect(true, true))
          {
            disconnected = true;
#ifdef _DEBUG_
            Serial.println("[Diabled] Clear cached wifi successfully! ");
#endif
          }
        }
      }
      countConnectionFailure++;
    }
  }

  if (millis() - blinkStart > STATUS_START_DELAY_FLICKER_SHORT) // this is animation status run mode
  {
    if (countBlink < 4)
    {
      blinkStart = millis();
      if (countBlink % 2 == 0)
      {
        digitalWrite(STATUS_PIN_START, HIGH);
      }
      else
      {
        digitalWrite(STATUS_PIN_START, LOW);
      }
      countBlink++;
    }
    else if (millis() - blinkStart > STATUS_START_DELAY_FLICKER_LONG)
    {
      blinkStart = millis();
      countBlink = 0;
    }
  }

  if (!disableBtnReset)
  {

    if (digitalRead(PIN_RESET_DEFLAUT) == LOW && !blockBtnReset)
    {
      timeStartResetPinDetach = millis();
      blockBtnReset = true;
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start btn HIGH");
#endif
    }

    if (digitalRead(PIN_RESET_DEFLAUT) == HIGH && blockBtnReset)
    {
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start btn LOW");
#endif
      blockBtnReset = false;
    }

    if (millis() - timeStartResetPinDetach > TIME_RESET_DEFAULT && blockBtnReset)
    {
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start Reset Default");
#endif

      if (eeprom.DATABASE_NODE.length() > 0)
      {
        Firebase.RTDB.endStream(&fbdoStream);
        clearBufferFirebaseDataAll();

        // ????
        removeNodeEsp();

        // reset link application
        eeprom.saveNodeID("");
        eeprom.saveUserID("");

        // reset wifi configration
        eeprom.savePassword("");
        eeprom.saveSSID("");
      }
      else
      {
#ifdef _DEBUG_
        Serial.println("[DEBUG] Not found node url to remove!");
#endif
      }

#ifdef LOGIC
      globalRestart = true;
#endif

#ifdef COLOR
      eeprom.saveModeColor(SINGLE);
      requestRestart = true;
      clearEffect = true;
#endif
      disableBtnReset = true;
      blockBtnReset = false;
    }
  }

  if (millis() - poolingCheckStream > POOLING_CHECK_STREAM)
  {
    poolingCheckStream = millis();
#ifdef _DEBUG_
    Serial.printf("[DEBUG] State Stream - [%s]\n", fbdoStream.isStream() ? "true" : "false");
#endif
  }

#ifdef LOGIC
#ifdef _RELEASE_
  if (Serial.available() > 0)
  {
    uartPicControl = (int)Serial.parseInt();
    if (uartPicControl > 0 && blockControl == false)
    {
      control = uartPicControl % 2 == 0 ? false : true;
      if (uartPicControl < 3)
      {
        idControl = 1;
      }
      else if (uartPicControl < 5)
      {
        idControl = 2;
      }
      else if (uartPicControl < 7)
      {
        idControl = 3;
      }
      if (millis() - timeDebounceLocalControl > 1000)
      {
        timeDebounceLocalControl = millis();
        if (WiFi.status() == WL_CONNECTED)
        {
          controllDevice(idControl, control, true, true);
        }
        else
        {
          controllDevice(idControl, control, false, true);
        }
      }
    }
  }
#endif
  if ((millis() - sendDataPrevMillis > 2500 || sendDataPrevMillis == 0))
  {
    sendDataPrevMillis = millis();
    if (timerStack[0][1] != NULL && timeControll)
    {
#ifdef _DEBUG_
      PrintListTimer();
#endif
      epochTime = Get_Epoch_Time();
#ifdef _DEBUG_
      Serial.println("TimeStamp = " + String(epochTime));
#endif
      bool expire = timerStack[0][1] > epochTime && timerStack[0][1] != NULL ? false : true;
      if (expire)
      {
        unsigned long rangeTimer = epochTime - timerStack[0][1];
        if (rangeTimer < 4)
        {
#ifdef _RELEASE_
          bool state = timerStack[0][2] == 1 ? true : timerStack[0][2] == 2           ? false
                                                  : stateDevice[timerStack[0][0] - 1] ? false
                                                                                      : true;
          controllDevice(timerStack[0][0], state, true);
#endif
        }
#ifdef _DEBUG_
        Serial.printf("Controll timer = %d\n", timerStack[0][1]);
        Serial.printf("[Epoch Time] = %d", rangeTimer);
#endif
        removeTimer(timerStack, indexTimerStack, indexTimerStack[0]);
      }
    }
  }
#endif

#ifdef COLOR
  // execute something...
  if (clearEffect)
  {
    clearEffectColor();
    clearEffect = false;
  }
  if (eeprom.modeRGBs == SINGLE && !clearEffect)
  {
    if (acceptChange)
    {
      while (true)
      {
        bool resultR = fadeColor(COLOR_R);
        bool resultG = fadeColor(COLOR_G);
        bool resultB = fadeColor(COLOR_B);
        bool resultALPHA = fadeColor(COLOR_ALPHA);
        setColorChainRGBA(strip.Color(colorPresentState[0], colorPresentState[1], colorPresentState[2]), colorPresentState[3]);
        if (!resultR && !resultG && !resultB && !resultALPHA)
        {
          break;
        }
      }
      acceptChange = false;
    }
  }
  else if (eeprom.modeRGBs == AUTO && !clearEffect)
  {
    strip.setPixelColor(autoIndexI, Wheel(((autoIndexI * 256 / strip.numPixels()) + autoIndexJ) & 255));
    autoIndexI++;
    if (autoIndexI >= strip.numPixels() && millis() - rgbModeAuto > 20)
    {
      rgbModeAuto = millis();
      autoIndexI = 0;
      autoIndexJ++;
      strip.show();
    }
    if (autoIndexJ >= (256 * 5) - 1)
    {
      autoIndexJ = 0;
    }
  }

#endif

#ifdef _DEBUG_
  if (millis() - timeIntervalCheckRamSize > 2500)
  {
    timeIntervalCheckRamSize = millis();
    checkRam();
  }
#endif

  esp_task_wdt_reset();
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* START DEFINE FUNCTION REQUEST *********]
 *
 */

