rikkapro0128/system_node_esp32_iot/src/main.cpp
void controllDevices(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    JsonObject body = json.as<JsonObject>();

#ifdef LOGIC
    String userId = body["uid"];
    if (eeprom.readUserID() == userId)
    {
      String deviceId = body["did"];
      if ((GEN_ID_BY_MAC + "-1").equals(deviceId))
      {
        bool state = body["state"];
        controllDevice(1, state);
#ifdef _DEBUG_
        Serial.println("[DEBUG] Controll Switch 1");
#endif
      }
      else if ((GEN_ID_BY_MAC + "-2").equals(deviceId))
      {
        bool state = body["state"];
        controllDevice(2, state);
#ifdef _DEBUG_
        Serial.println("[DEBUG] Controll Switch 2");
#endif
      }
      else if ((GEN_ID_BY_MAC + "-3").equals(deviceId))
      {
        bool state = body["state"];
        controllDevice(3, state);
#ifdef _DEBUG_
        Serial.println("[DEBUG] Controll Switch 3");
#endif
      }
      else
      {
        request->send(403, "application/json", "{\"message\":\"ID DEVICE NOT EXIST\"}");
      }
    }
    else
    {
      request->send(403, "application/json", "{\"message\":\"YOU NO PERMISSION\"}");
    }
#endif

#ifdef COLOR
    String userId = body["uid"];
    String deviceId = body["did"];
    if (eeprom.readUserID() == userId && GEN_ID_BY_MAC == deviceId)
    {
      uint8_t mode = body["mode"];
      if (mode != eeprom.modeRGBs)
      {
        eeprom.modeRGBs = mode;
        eeprom.saveModeColor(eeprom.modeRGBs);
#ifdef _DEBUG_
        Serial.println("[DEBUG] Change Mode Color");
#endif
      }
      if (eeprom.modeRGBs == SINGLE)
      {
        uint8_t colorR = body["value"]["r"];
        uint8_t colorG = body["value"]["g"];
        uint8_t colorB = body["value"]["b"];
        uint8_t colorA = body["value"]["a"];
        colorFultureState[0] = colorR;
        colorFultureState[1] = colorG;
        colorFultureState[2] = colorB;
        colorFultureState[3] = colorA;
        acceptChange = true;
#ifdef _DEBUG_
        Serial.println("[DEBUG] Change color style value of mde single");
#endif
      }
      else if (eeprom.modeRGBs == AUTO)
      {
        clearEffect = true;
#ifdef _DEBUG_
        Serial.println("[DEBUG] Change color mode auto");
#endif
      }
    }
    else
    {
      request->send(403, "application/json", "{\"message\":\"YOU NO PERMISSION\"}");
    }
#endif

    request->send(200, "application/json", "{\"message\":\"CONTROLL SUCCESSFULLY\"}");
  }
  else
  {
    request->send(401, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

void pingResponse(AsyncWebServerRequest *request)
{
  String response_str;
  DynamicJsonDocument response_json(400);
  JsonObject payload = response_json.to<JsonObject>();

#ifdef LOGIC
  payload["devices"][0]["id"] = GEN_ID_BY_MAC + "-1";
  payload["devices"][0]["state"] = stateDevice[0];
  payload["devices"][0]["type"] = TYPE_DEVICE;

  payload["devices"][1]["id"] = GEN_ID_BY_MAC + "-2";
  payload["devices"][1]["state"] = stateDevice[1];
  payload["devices"][1]["type"] = TYPE_DEVICE;

  payload["devices"][2]["id"] = GEN_ID_BY_MAC + "-3";
  payload["devices"][2]["state"] = stateDevice[2];
  payload["devices"][2]["type"] = TYPE_DEVICE;

#endif

#ifdef COLOR
  payload["devices"][0]["id"] = GEN_ID_BY_MAC;
  payload["devices"][0]["type"] = TYPE_DEVICE;
  payload["devices"][0]["mode"] = eeprom.modeRGBs;

  payload["devices"][0]["value"]["r"] = colorFultureState[0];
  payload["devices"][0]["value"]["g"] = colorFultureState[1];
  payload["devices"][0]["value"]["b"] = colorFultureState[2];
  payload["devices"][0]["value"]["contrast"] = colorFultureState[3];
#endif

  payload["uid"] = eeprom.readUserID();
  payload["nodeId"] = eeprom.readNodeID();

  serializeJson(payload, response_str);
  request->send(200, "application/json", response_str);
  response_json.clear();
  payload.clear();
}

void restartEsp(AsyncWebServerRequest *request)
{
  request->send(200, "application/json", "{\"message\":\"ESP RESTARTED\"}");
  globalRestart = true;
}

void notFound(AsyncWebServerRequest *request)
{
  request->send(404, "text/plain", "Not found");
}

// [POST]
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    // if (eeprom.canAccess)
    // {
#ifdef _DEBUG_
    Serial.println("DB Node = " + eeprom.DATABASE_NODE);
    Serial.println("Wifi Status = " + String(WiFi.status()));
#endif
    JsonObject body = json.as<JsonObject>();
    String idUser = body["idUser"];
    String idNode = body["idNode"];
#ifdef _DEBUG_
    Serial.println("Link App: idUser = " + idUser + " - idNode = " + idNode);
#endif
    if (idUser.length() > 0 && idNode.length() > 0)
    {
      clearBufferFirebaseDataAll();
      bool stateSaveNodeId = false;
      bool stateSaveUserId = false;
      if (removeNodeEsp())
      {
        stateSaveNodeId = eeprom.saveNodeID(idNode);
        stateSaveUserId = eeprom.saveUserID(idUser);
      }
      esp_task_wdt_reset();
      if (stateSaveNodeId && stateSaveUserId)
      {
        clearBufferFirebaseDataAll();
#ifdef _DEBUG_
        Serial.println("--- Start Init New Firebase Stream ---");
#endif
        checkFirebaseInit();
        createNode.clear();
        // if (fbdoStream.isStream())
        // {
        request->send(200, "application/json", "{\"message\":\"LINK APP HAS BEEN SUCCESSFULLY\"}");
        // }
        // else
        // {
        //   request->send(400, "application/json", "{\"message\":\"LINK APP HAS BEEN FAILURE\"}");
        // }
      }
      else
      {
        request->send(500, "application/json", "{\"message\":\"FAILURE SAVE PAYLOADS\"}");
      }
    }
    else
    {
      if (idUser.length() <= 0)
      {
        request->send(400, "application/json", "{\"message\":\"ID USER IS NULL\"}");
      }
      else if (idNode.length() <= 0)
      {
        request->send(400, "application/json", "{\"message\":\"ID NODE IS NULL\"}");
      }
      else
      {
        request->send(400, "application/json", "{\"message\":\"PAYLOAD INVALID\"}");
      }
    }
    // }
    // else
    // {
    //   request->send(500, "application/json", "{\"message\":\"SOMETHING WENT WRONG\"}");
    // }
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void restartWifiAccess(AsyncWebServerRequest *request)
{
  request->send(200, "application/json", "{\"message\":\"RESTART WIFI ACCESS SUCESSFULLY!\"}");
  countConnectionFailure = 0;
  disconnected = false;
  setupWifiModeStation();
  restartConfigWifi = true;
}

// [POST]
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    JsonObject body = json.as<JsonObject>();

    String ssid = body["ssid"];
    String password = body["password"];
    eeprom.saveSSID(ssid);
    eeprom.savePassword(password);
    // Serial.println("[Save config EEPROM]");
    request->send(200, "application/json", "{\"message\":\"CONFIGURATION WIFI SUCCESSFULLY\"}");
    countConnectionFailure = 0;
    disconnected = false;
    setupWifiModeStation();
    restartConfigWifi = true;
  }
  else
  {
    request->send(400, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void resetConfigurationWifi(AsyncWebServerRequest *request)
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("reset config: wifi = " + ssid + " - password = " + password);
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    eeprom.saveSSID("");
    eeprom.savePassword("");
  }
  request->send(200, "application/json", "{\"message\":\"RESET CONFIG SUCCESSFULLY\"}");
}

void resetConfigurationFirebase(AsyncWebServerRequest *request)
{
  String response_str;
  DynamicJsonDocument response_json(200);
  size_t index = 0;

