rikkapro0128/system_node_esp32_iot/src/main.cpp
void controllDevice(uint8_t numDevice, bool state, bool syncFirebase, bool ignore)
{
#ifdef _RELEASE_
  blockControl = true;
  if (!ignore)
  {
    Serial.printf("188%c%d\n", state ? 'n' : 'f', numDevice);
  }
  if (syncFirebase)
  {
    String pathControll = eeprom.DATABASE_NODE + "/devices/" + ID_DEVICE + "-" + String(numDevice) + "/state";
    while (!Firebase.RTDB.setBool(&fbdoControl, pathControll, state))
    {
      if (WiFi.status() != WL_CONNECTED)
      {
        break;
      }
    };
  }
  stateDevice[numDevice - 1] = state;
  blockControl = false;
#endif
}

void parserTimerJson(FirebaseStream &data, uint8_t numberDevice, bool isInit)
{
  String deviceField = "device-" + GEN_ID_BY_MAC + "-" + numberDevice;
  if (isInit)
  {
    if (data.jsonObject().get(timerJson, deviceField + "/timer"))
    {
      timerJson.get<FirebaseJson>(timerParseArray);
      readTimer(timerParseArray, numberDevice);
      timerJson.clear();
    }
  }
  else
  {
    readTimer(data.jsonObject(), numberDevice, data.dataPath().substring(29, 49));
  }
}

void readTimer(FirebaseJson &fbJson, uint8_t numberDevice, String keyAdd)
{
  size_t numTimerPayload = fbJson.iteratorBegin();
  FirebaseJson::IteratorValue timerItem;
  size_t indexStart;
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (timerStack[i][0] == NULL && timerStack[i][1] == NULL && timerStack[i][2] == NULL)
    {
      indexStart = i;
      break;
    }
  }
  for (size_t i = 0; i < numTimerPayload; i++)
  {
    if (indexStart < 30)
    {
      timerItem = fbJson.valueAt(i);
      if (timerItem.key.equals("unix"))
      {
        timerStack[indexStart][0] = numberDevice;
        timerStack[indexStart][1] = timerItem.value.toInt();
      }
      else if (timerItem.key.equals("value"))
      {
        timerStack[indexStart][2] = timerItem.value.toInt();
        if (keyAdd.length() > 0)
        {
          strcpy(indexTimerStack[indexStart], keyAdd.c_str());
        }
        indexStart++;
      }
      else
      {
        strcpy(indexTimerStack[indexStart], timerItem.key.c_str());
      }
    }
    else
    {
      break;
    }
  }
  fbJson.iteratorEnd();
}

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION NODE -> TYPE "COLOR" *********]
 *
 */
#ifdef COLOR
// ..... define here ...

uint32_t Wheel(byte WheelPos)
{
  WheelPos = 255 - WheelPos;
  if (WheelPos < 85)
  {
    return strip.Color(255 - WheelPos * 3, 0, WheelPos * 3);
  }
  if (WheelPos < 170)
  {
    WheelPos -= 85;
    return strip.Color(0, WheelPos * 3, 255 - WheelPos * 3);
  }
  WheelPos -= 170;
  return strip.Color(WheelPos * 3, 255 - WheelPos * 3, 0);
}

bool fadeColor(INDEX_COLOR index)
{
  if (colorPresentState[index] > colorFultureState[index])
  {
    colorPresentState[index] = --colorPresentState[index];
    return true;
  }
  else if (colorPresentState[index] < colorFultureState[index])
  {
    colorPresentState[index] = ++colorPresentState[index];
    return true;
  }
  else
  {
    return false;
  }
}

void setColorChainRGBA(uint32_t c, uint8_t a)
{
  for (uint16_t i = 0; i < strip.numPixels(); i++)
  {
    strip.setPixelColor(i, c);
  }
  strip.setBrightness(a);
  strip.show();
}

void clearEffectColor(uint8_t brightness)
{
  strip.setBrightness(brightness);
  for (uint16_t i = 0; i < strip.numPixels(); i++)
  {
    strip.setPixelColor(i, strip.Color(0, 0, 0));
    strip.show();
    delay(10);
  }
  if (requestRestart)
  {
    globalRestart = true;
  }
  colorPresentState[0] = 0;
  colorPresentState[1] = 0;
  colorPresentState[2] = 0;
  colorPresentState[3] = 0;
  acceptChange = true;
}

void parserColorRGB(FirebaseStream &data, String prefix)
{
  data.jsonObject().get(deviceJson, prefix + "r");
  uint8_t colorR = deviceJson.to<int>();
  colorFultureState[0] = colorR;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "g");
  uint8_t colorG = deviceJson.to<int>();
  colorFultureState[1] = colorG;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "b");
  uint8_t colorB = deviceJson.to<int>();
  colorFultureState[2] = colorB;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "contrast");
  uint8_t alpha = deviceJson.to<int>();
  colorFultureState[3] = alpha;
  deviceJson.clear();
  acceptChange = true;
}

uint8_t parserColorMode(FirebaseStream &data, bool init)
{
  if (init)
  {
    data.jsonObject().get(deviceJson, "mode");
    return deviceJson.to<uint8_t>();
  }
  else
  {
    return data.to<uint8_t>();
  }
}

uint8_t parserNumsLed(FirebaseStream &data, bool init)
{
  if (init)
  {
    data.jsonObject().get(deviceJson, "nums-Led");
    return deviceJson.to<uint8_t>();
  }
  else
  {
    return data.to<uint8_t>();
  }
}

#endif
/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION GENERAL *********]
 *
 */

void initSignal()
{
  pinMode(STATUS_PIN_START, OUTPUT);
  pinMode(STATUS_PIN_WIFI, OUTPUT);

  digitalWrite(STATUS_PIN_START, LOW);
  digitalWrite(STATUS_PIN_WIFI, LOW);
}

void initResetDeflaut()
{
  pinMode(PIN_RESET_DEFLAUT, INPUT_PULLUP);
}

uint32_t ramHeapSize()
{
  return ESP.getFreeHeap();
}

void clearBufferFirebaseDataAll()
{
  fbdoStream.clear();
  fbdoControl.clear();
  createNode.clear();
  removeNode.clear();
}

void setupStreamFirebase()
{
  esp_task_wdt_reset();
  Firebase.RTDB.setStreamCallback(&fbdoStream, streamCallback, streamTimeoutCallback);
  String pathStream;
#ifdef LOGIC
  pathStream = eeprom.DATABASE_NODE + "/devices";
#endif
#ifdef COLOR
  pathStream = eeprom.DATABASE_NODE + "/devices/device-" + GEN_ID_BY_MAC;
#ifdef _DEBUG_
  Serial.println("[DEBUG] Path Stream = " + pathStream);
#endif
#endif
  if (pathStream.length() > 0)
  {
    if (!Firebase.RTDB.beginStream(&fbdoStream, pathStream))
    {
#ifdef _DEBUG_
      Serial_Printf("stream begin error, %s\n\n", fbdoStream.errorReason().c_str());
#endif
    }
    else
    {
#ifdef _DEBUG_
      Serial.println(String("Stream OK!"));
#endif
    }
  }
}

void streamCallback(FirebaseStream data)
{
#ifdef _DEBUG_
  Serial_Printf("sream path, %s\nevent path, %s\ndata type, %s\nevent type, %s\n\n",
                data.streamPath().c_str(),
                data.dataPath().c_str(),
                data.dataType().c_str(),
                data.eventType().c_str());
  Serial.println();
  Serial_Printf("Received stream payload size: %d (Max. %d)\n\n", data.payloadLength(), data.maxPayloadLength());
#endif
  String dataPath = data.dataPath();
  uint8_t dataType = data.dataTypeEnum();
#ifdef LOGIC
  uint8_t numDevice = (uint8_t)(dataPath.substring(21, 22).toInt());
  if (dataType == d_boolean)
  {
    if (dataPath.indexOf("state") > 0 || numDevice) // execute controll turn on device by [INDEX]
    {
      if (data.dataTypeEnum() == fb_esp_rtdb_data_type_boolean)
      {
        bool state = data.to<boolean>();
        if (!blockControl)
        {
          controllDevice(numDevice, state);
        }
      }
    }
  }
  else if (dataType == d_json)
  {
    if (dataPath.equals("/") && isFirst)
    { // execute init state all device
#ifdef _DEBUG_
      Serial.println("Init Status");
#endif
      parserTimerJson(data, 1);
      parserTimerJson(data, 2);
      parserTimerJson(data, 3);

      sortTimer(timerStack, indexTimerStack);

