rikkapro0128/system_node_esp32_iot/src/main.cpp
      parserDeviceStatus(data, 1);
      parserDeviceStatus(data, 2);
      parserDeviceStatus(data, 3);
      timeControll = true;
      isFirst = false;
    }
    else if (dataPath.indexOf("timer") > 0 && numDevice)
    {
      parserTimerJson(data, numDevice, false); // add timer to list timer
      sortTimer(timerStack, indexTimerStack);
      timeControll = true;
    }
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
  else if (dataType == d_null)
  {
    removeTimer(timerStack, indexTimerStack, dataPath.substring(29, 49), true);
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
#endif
#ifdef COLOR

  if (dataType == d_json)
  {
    if (dataPath == "/")
    {

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Mode Color = " + String(eeprom.modeRGBs));
#endif
      eeprom.saveModeColor(parserColorMode(data, true));
      eeprom.saveNumsLed(parserNumsLed(data, true));

      if (eeprom.modeRGBs == SINGLE)
      {
        // Parser Data led RGB here

#ifdef _DEBUG_
        Serial.println("[DEBUG] Data Color = " + data.jsonString());
#endif
        parserColorRGB(data, "value/");
      }
    }
    else if (dataPath.indexOf("value") > 0)
    {

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Color = " + data.jsonString());
#endif
      parserColorRGB(data);
    }
  }
  else if (dataType == d_integer)
  {
    if (dataPath.indexOf("mode") > 0)
    {
      eeprom.modeRGBs = parserColorMode(data);
      eeprom.saveModeColor(eeprom.modeRGBs);
      clearEffect = true;

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Mode Color = " + String(eeprom.modeRGBs));
#endif
    }
    else if (dataPath == "/nums-Led")
    {
      uint8_t numsLed = parserNumsLed(data);
      eeprom.saveNumsLed(numsLed);
      strip.updateLength((uint16_t)numsLed);
#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Num Led Change = " + String(numsLed));
#endif
      clearEffect = true;
    }
  }

#endif
}

void streamTimeoutCallback(bool timeout)
{
#ifdef _DEBUG_
  if (timeout)
  {
    Serial.println("Stream timed out, resuming...\n");
  }
  else
  {
  }
  if (!fbdoStream.httpConnected())
  {
    Serial_Printf("error code: %d, reason: %s\n\n", fbdoStream.httpCode(), fbdoStream.errorReason().c_str());
  }
#endif
}

void checkFirebaseInit()
{
  // [Check] - NodeID is exist

  if (eeprom.canAccess)
  {
    String pathDevice = String(eeprom.DATABASE_NODE + "/devices");
    bool statePath = Firebase.RTDB.pathExisted(&fbdoStream, pathDevice);
#ifdef _DEBUG_
    Serial.println(String("PATH Device = " + String(pathDevice)));
    Serial.println(String("State Path = " + String(statePath)));
#endif
    if (!statePath)
    {
      jsonNewDevice.clear();
#ifdef LOGIC
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-1/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-1/type", TYPE_DEVICE);

      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-2/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-2/type", TYPE_DEVICE);

      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-3/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-3/type", TYPE_DEVICE);
#endif

#ifdef COLOR
      // ... init device COLOR
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/r", colorFultureState[0]);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/g", colorFultureState[1]);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/b", colorFultureState[2]);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/contrast", colorFultureState[3]);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/type", TYPE_DEVICE);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/mode", (uint8_t)SINGLE);
#endif

      esp_task_wdt_reset();
      if (Firebase.RTDB.setJSON(&createNode, pathDevice, &jsonNewDevice))
      {
        createNode.clear();
      }

#ifdef _DEBUG_
      Serial.println("[CREATED] - NEW LIST DEVICE");
#endif
    }
    if (fbdoStream.isStream())
    {
      Firebase.RTDB.endStream(&fbdoStream);
    }
    setupStreamFirebase();
  }
}

void setupWifiModeStation()
{
  // ACTIVE MODE AP
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("<--- STATION WIFI --->");
  Serial.println("[SSID] = " + String(ssid));
  Serial.println("[PASSWORD] = " + String(password));
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    if (WiFi.isConnected())
    {
      WiFi.disconnect(true);
    }
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    WiFi.begin(ssid.c_str(), password.c_str());
  }
}

unsigned int strLength(const char *str)
{
  return sizeof(str) / sizeof(char);
}

void setupWebserverModeAP()
{
  // [GET] - ROUTE: '/' => Render UI interface
  // server.serveStatic("/", LittleFS, "/index.minify.html");
  // [GET] - ROUTE: '/reset-config' => Reset config WIFI
  // server.on("/scan-network", HTTP_GET, scanListNetwork);
  // [GET] - ROUTE: '/ping' => Pong to request
  server.on("/ping", HTTP_GET, pingResponse);
  // [GET] - ROUTE: '/is-config' => Check WIFI is configuration
  server.on("/is-config", HTTP_GET, checkConfiguration);
  // [GET] - ROUTE: '/restart' => restart ESP
  server.on("/restart", HTTP_GET, restartEsp);
  // [POST] - ROUTE: '/reset-config-wifi' => Reset config WIFI
  server.on("/reset-config-wifi", HTTP_POST, resetConfigurationWifi);
  // [POST] - ROUTE: '/reset-config-firebase' => Reset config firebase
  server.on("/reset-config-firebase", HTTP_POST, resetConfigurationFirebase);
  // [POST] - ROUTE: '/reset-config-firebase' => restart wifi access
  server.on("/restart-wifi-access", HTTP_POST, restartWifiAccess);
  // [POST] - ROUTE: '/controll' => Controll Device
  AsyncCallbackJsonWebHandler *handlerControllDevices = new AsyncCallbackJsonWebHandler("/controll", controllDevices);
  // [POST] - ROUTE: '/config-wifi' => Goto config WIFI save below EEPROM
  AsyncCallbackJsonWebHandler *handlerAddConfig = new AsyncCallbackJsonWebHandler("/config-wifi", addConfiguration);
  // [POST] - ROUTE: '/link-app' => Goto config firebase save below EEPROM
  AsyncCallbackJsonWebHandler *handlerLinkApp = new AsyncCallbackJsonWebHandler("/link-app", linkAppication);
  // [GET] - ROUTE: '/is-link-app' => Check configuration link-app
  server.on("/is-link-app", HTTP_GET, checkLinkAppication);
  // [GET] - ROUTE: '/*any' => Check configuration link-app
  server.onNotFound(notFound);

