rikkapro0128/system_node_esp32_iot/src/main.cpp
  // START WEBSERVER
  server.addHandler(handlerControllDevices);
  server.addHandler(handlerAddConfig);
  server.addHandler(handlerLinkApp);
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  server.begin();
}

unsigned long Get_Epoch_Time()
{
  time_t now;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
  {
    // Serial.println("Failed to obtain time");
    return (0);
  }
  time(&now);
  return now;
}

bool removeNodeEsp()
{
  bool result = false;
  if (ramHeapSize() > SSL_HANDSHAKE_REQUIRE * 1000)
  {
#ifdef _DEBUG_
    Serial.println("[DEBUG] Remove Database node: " + eeprom.DATABASE_NODE);
#endif
    if (Firebase.RTDB.deleteNode(&removeNode, eeprom.DATABASE_NODE))
    {
      result = true;
#ifdef _DEBUG_
      Serial.println("[DEBUG] Remove Database node successfull!");
#endif
    }
    else
    {
#ifdef _DEBUG_
      Serial.println("[DEBUG] Remove Database node failure!");
#endif
    }
  }
  else
  {

#ifdef _DEBUG_
    Serial.println("[DEBUG] Heap ram not enough to handshake ssl delete node!");
#endif
  }
  return result;
}

void initWatchdogTimer()
{
  esp_task_wdt_init(WDT_TIMEOUT, true); // enable panic so ESP32 restarts
  esp_task_wdt_add(NULL);               // add current thread to WDT watch
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */
